[
  {
    "title": "Sudoku Generator & Solver",
    "start": "Oct 2023",
    "end": "Oct 2023",
    "description": [
      "Developed a Sudoku puzzle generator using a backwards puzzle solving algorithm in Python.",
      "Handled cross-application data transfer using object-oriented programming.",
      "Used the 'tkinter' library to create a user interface allowing for cross-platform compatability."
    ],
    "tags": [
      "Software"
    ],
    "media": "media/sudoku.jpg",
    "link": "https://jkhamanishi.github.io/sudoku/"
  },
  {
    "title": "Snake Game",
    "start": "Oct 2023",
    "end": "Oct 2023",
    "description": [
      "Recreated the Snake game in C++.",
      "Used the Windows API (Win32) to create a graphical user inteface.",
      "Embedded MS Windows resources in the portable executable file.",
      "Created a custom icon and menu for the application.",
      "Allowed for customizable keyboard input options."
    ],
    "tags": [
      "Software"
    ],
    "media": "media/snake.jpg",
    "link": "https://github.com/jkhamanishi/snake"
  },
  {
    "title": "Curriculum Planner Web Application",
    "start": "Dec 2020",
    "end": "Oct 2023",
    "description": [
      "Created a web application to help students in the School of Mechatronic Systems Engineering at SFU plan out their curriculum.",
      "Designed and organized curriculum data using CSV files, JavaScript, and HTML.",
      "Received feedback and feature requests from users and adjusted the application accordingly."
    ],
    "tags": [
      "Web Apps"
    ],
    "media": "media/Course Navigator.jpg",
    "link": "https://jkhamanishi.github.io/course-navigator/"
  },
  {
    "title": "Pancake Flipping & Serving Robot",
    "start": "May",
    "end": "Aug 2023",
    "description": [
      "Developed a 5-DoF manipulator to perform pancake cooking and serving tasks.",
      "Designed the manipulator links in SolidWorks.",
      "Generated the path trajectory and simulated the manipulator motion using MATLAB.",
      "Analyzed the kinematics, dynamics, and Jacobian of the system."
    ],
    "tags": [
      "Robotics",
      "Mechanical",
      "Software"
    ],
    "media": "media/Pancake Robot.gif",
    "modalMedia": "media/Pancake Robot.mp4"
  },
  {
    "title": "High-Precision Mechatronic Catapult",
    "start": "May",
    "end": "Aug 2023",
    "description": [
      "Created a catapult to precisely launch balls of various weights into a target.",
      "Designed an arm in SolidWorks and assembled the arm using brass pieces and solder.",
      "Constructed an electronic interface to connect an Arduino to the motor drive.",
      "Built a feedback control system to accurately operate the arm."
    ],
    "tags": [
      "Robotics",
      "Mechanical",
      "Electrical",
      "Software"
    ],
    "media": "media/Catapult.jpg",
    "modalMedia": "media/Catapult.mp4"
  },
  {
    "title": "Rodent Laser Sentry",
    "start": "Jan",
    "end": "Aug 2023",
    "description": [
      "Worked in a team of five to fabricate a device to detect, identify, aim, and shoot at rodents.",
      "Trained a rodent identification model using deep learning computer vision (OpenCV).",
      "Controlled a low-powered laser pointer using a closed-loop motor control scheme in Python.",
      "Created a GUI in Python Qt to monitor sensors, control actuators, and present statistics for development and commercial applications."
    ],
    "tags": [
      "Robotics",
      "Software"
    ],
    "media": "media/Rodent Laser Sentry.jpg",
    "modalMedia": "media/Rodent Laser Sentry.mp4"
  },
  {
    "title": "Servomotor Speed Controller with 8051 MCU",
    "start": "Sep",
    "end": "Nov 2022",
    "description": [
      "Created a controller for a brushless DC axial fan in C.",
      "Developed a PWM signal generator using a closed-loop feedback controller to adjust the speed of the motor.",
      "Presented the speed of the fan onto three 7-segment displays."
    ],
    "tags": [
      "Electrical",
      "Software"
    ],
    "media": "",
    "link": ""
  },
  {
    "title": "Maze Solver Robot",
    "start": "Nov",
    "end": "Dec 2022",
    "description": [
      "Created a LEGO robot to navigate and solve a maze in C.",
      "Developed an algorithm to determine the most efficient path to solve the maze.",
      "Used an ultrasonic sensor to detect walls, paths, and dead-ends."
    ],
    "tags": [
      "Robotics",
      "Software"
    ],
    "media": ""
  },
  {
    "title": "Line Follower Robot",
    "start": "Sep",
    "end": "Nov 2022",
    "description": [
      "Created a LEGO robot to follow a line and react to an obstacle using C and Python.",
      "Used an ultrasonic sensor to detect obstacles and a light/colour sensor to detect the line."
    ],
    "tags": [
      "Robotics",
      "Software"
    ],
    "media": "media/Line Follower.jpg",
    "modalMedia": "media/Line Follower.mp4"
  },
  {
    "title": "Lab Environment Condition Monitoring",
    "start": "May",
    "end": "Sep 2022",
    "description": [
      "Assisted in the automation of recording environmental data (temperature and humidity) throughout the lab.",
      "Used I2C sensors, multiplexers, and Raspberry Pis to record conditions at different locations in a lab room.",
      "Wrote a Python script to periodically send live and historical data to a database"
    ],
    "tags": [
      "Electrical",
      "Software"
    ]
  },
  {
    "title": "Full-Stack Development for R&D",
    "start": "Jan",
    "end": "Sep 2022",
    "description": [
      "Developed the pipeline for lab researchers to collect and record data into a database on AWS.",
      "Created data ingestion forms and data visualization pages using Python, JavaScript, and CSS.",
      "Maintained and upgraded the LabVIEW and Python scripts for spectrometer testing stations to automatically send measurements to the database.",
      "Collected environmental data throughout the lab and visually presented current and historical lab conditions on demand."
    ],
    "tags": [
      "Software",
      "Web Apps"
    ]
  },
  {
    "title": "Online Art Database (Digital Memory Box Database)",
    "start": "Apr 2019",
    "end": "Aug 2022",
    "description": [
      "Developed an online database of artwork for my high school gifted education program.",
      "Organized and collected artwork and artist information, and ensured the data is accurate, consistent, and inside the correct portfolio.",
      "Stored artist data in an Excel spreadsheet, then converted it to HTML using VBA and JavaScript."
    ],
    "tags": [
      "Web Apps"
    ],
    "media": "",
    "link": ""
  },
  {
    "title": "Indexing Drive Machine Design",
    "start": "Oct",
    "end": "Dec 2021",
    "description": [
      "Led a team of four, delegating tasks and maintaining timelines to ensure project requirements were met.",
      "Determined the optimal material for each part based on strength, fatigue limit, and accessibility.",
      "Designed and analyzed the motor beam, angled support, support beams, chains and gear shaft.",
      "Created a SolidWorks model of the parts to optimize the topology, perform stress analysis, simulate the movement of the system."
    ],
    "tags": [
      "Mechanical"
    ],
    "media": "media/Indexing Drive.gif",
    "link": ""
  },
  {
    "title": "Industrial Control Technology (ICT3) Unit Controller",
    "start": "Sep",
    "end": "Dec 2021",
    "description": [
      "Programmed an automatic controller for an industrial assembly system using LabVIEW.",
      "Utilized a variety of sensors and actuators to sort components, assemble units, and verify the assembly.",
      "Created an interactive user interface to view sensor data and manually operate actuators."
    ],
    "tags": [
      "Software",
      "Robotics"
    ],
    "media": "media/ICT.jpg",
    "modalMedia": "media/ICT.mp4"
  },
  {
    "title": "Four-Bar Critter Leg Mechanism Design",
    "start": "Feb",
    "end": "Apr 2021",
    "description": [
      "Worked in a team to design a four-bar linkage that mimics the movement of a multi-leg critter.",
      "Analysed the kinematics and dynamics for each of the four bars using mathematical models and computational methods in MATLAB.",
      "Created a SolidWorks model of the linkage to visually simulate the movement of the system."
    ],
    "tags": [
      "Mechanical",
      "Software"
    ],
    "media": "media/Four-Bar Critter.gif",
    "link": ""
  },
  {
    "title": "3D CT Scan Visualization",
    "start": "Sep",
    "end": "Dec 2020",
    "description": [
      "Developed scripts in Bash and Python to quickly extract visual data from over 50 CT scans.",
      "Automatically rendered and visualized 3D models of organs.",
      "Scripted collages of extracted CT scan images and processed 3D models."
    ],
    "tags": [
      "Software"
    ]
  },
  {
    "title": "Bicycle Frame Design",
    "start": "Nov",
    "end": "Dec 2019",
    "description": [
      "Analyzed a pre-existing bike frame as a system of trusses and beams to perform stress calculations.",
      "Performed calculations to determine the relative safety in each bar.",
      "Proposed design change to improve safety and functionality of the bike.",
      "Assembled a detailed project report that outlined our findings and calculations."
    ],
    "tags": [
      "Mechanical"
    ],
    "media": "media/Bicycle Frame.jpg",
    "link": ""
  },
  {
    "title": "Water Bottle Catapult",
    "start": "Oct",
    "end": "Nov 2019",
    "description": [
      "Worked in a team to design a device that promotes persistent hydration to people of all ages.",
      "Designed and simulated a power efficient catapult in SolidWorks to launch water bottles.",
      "Combined SolidWorks drawings, part descriptions, and a design into a short technical report."
    ],
    "tags": [
      "Mechanical"
    ],
    "media": "",
    "link": ""
  },
  {
    "title": "Triboelectric Nanogenerator",
    "start": "Feb",
    "end": "Mar 2019",
    "description": [
      "Worked in a team to produce a prototype AC nanogenerator by utilizing the triboelectric effect and electrostatic induction.",
      "Tested, analyzed, and reported the generating effects of material, surface area, and contact frequency to determine the most optimal and cost-efficient product dimensions.",
      "Created a full bridge rectifier to convert AC to DC to light an LED.",
      "Constructed a technical report and slideshow presentation to fully illustrate our project outcomes."
    ],
    "tags": [
      "Mechanical",
      "Electrical"
    ],
    "media": "",
    "link": ""
  }
]
